RT-Thread/rt-thread/bsp/stm32/libraries/STM32WBxx_HAL/CMSIS/Device/ST/STM32WBxx/Include/stm32wb15xx.h
/********************  Bit definition for ADC_CFGR1 register  *****************/
#define ADC_CFGR1_DMAEN_Pos            (0U)
#define ADC_CFGR1_DMAEN_Msk            (0x1UL << ADC_CFGR1_DMAEN_Pos)          /*!< 0x00000001 */
#define ADC_CFGR1_DMAEN                ADC_CFGR1_DMAEN_Msk                     /*!< ADC DMA transfer enable */
#define ADC_CFGR1_DMACFG_Pos           (1U)
#define ADC_CFGR1_DMACFG_Msk           (0x1UL << ADC_CFGR1_DMACFG_Pos)         /*!< 0x00000002 */
#define ADC_CFGR1_DMACFG               ADC_CFGR1_DMACFG_Msk                    /*!< ADC DMA transfer configuration */

#define ADC_CFGR1_SCANDIR_Pos          (2U)
#define ADC_CFGR1_SCANDIR_Msk          (0x1UL << ADC_CFGR1_SCANDIR_Pos)        /*!< 0x00000004 */
#define ADC_CFGR1_SCANDIR              ADC_CFGR1_SCANDIR_Msk                   /*!< ADC group regular sequencer scan direction */

#define ADC_CFGR1_RES_Pos              (3U)
#define ADC_CFGR1_RES_Msk              (0x3UL << ADC_CFGR1_RES_Pos)            /*!< 0x00000018 */
#define ADC_CFGR1_RES                  ADC_CFGR1_RES_Msk                       /*!< ADC data resolution */
#define ADC_CFGR1_RES_0                (0x1UL << ADC_CFGR1_RES_Pos)            /*!< 0x00000008 */
#define ADC_CFGR1_RES_1                (0x2UL << ADC_CFGR1_RES_Pos)            /*!< 0x00000010 */

#define ADC_CFGR1_ALIGN_Pos            (5U)
#define ADC_CFGR1_ALIGN_Msk            (0x1UL << ADC_CFGR1_ALIGN_Pos)          /*!< 0x00000020 */
#define ADC_CFGR1_ALIGN                ADC_CFGR1_ALIGN_Msk                     /*!< ADC data alignement */

#define ADC_CFGR1_EXTSEL_Pos           (6U)
#define ADC_CFGR1_EXTSEL_Msk           (0x7UL << ADC_CFGR1_EXTSEL_Pos)         /*!< 0x000001C0 */
#define ADC_CFGR1_EXTSEL               ADC_CFGR1_EXTSEL_Msk                    /*!< ADC group regular external trigger source */
#define ADC_CFGR1_EXTSEL_0             (0x1UL << ADC_CFGR1_EXTSEL_Pos)         /*!< 0x00000040 */
#define ADC_CFGR1_EXTSEL_1             (0x2UL << ADC_CFGR1_EXTSEL_Pos)         /*!< 0x00000080 */
#define ADC_CFGR1_EXTSEL_2             (0x4UL << ADC_CFGR1_EXTSEL_Pos)         /*!< 0x00000100 */

#define ADC_CFGR1_EXTEN_Pos            (10U)
#define ADC_CFGR1_EXTEN_Msk            (0x3UL << ADC_CFGR1_EXTEN_Pos)          /*!< 0x00000C00 */
#define ADC_CFGR1_EXTEN                ADC_CFGR1_EXTEN_Msk                     /*!< ADC group regular external trigger polarity */
#define ADC_CFGR1_EXTEN_0              (0x1UL << ADC_CFGR1_EXTEN_Pos)          /*!< 0x00000400 */
#define ADC_CFGR1_EXTEN_1              (0x2UL << ADC_CFGR1_EXTEN_Pos)          /*!< 0x00000800 */

#define ADC_CFGR1_OVRMOD_Pos           (12U)
#define ADC_CFGR1_OVRMOD_Msk           (0x1UL << ADC_CFGR1_OVRMOD_Pos)         /*!< 0x00001000 */
#define ADC_CFGR1_OVRMOD               ADC_CFGR1_OVRMOD_Msk                    /*!< ADC group regular overrun configuration */
#define ADC_CFGR1_CONT_Pos             (13U)
#define ADC_CFGR1_CONT_Msk             (0x1UL << ADC_CFGR1_CONT_Pos)           /*!< 0x00002000 */
#define ADC_CFGR1_CONT                 ADC_CFGR1_CONT_Msk                      /*!< ADC group regular continuous conversion mode */
#define ADC_CFGR1_WAIT_Pos             (14U)
#define ADC_CFGR1_WAIT_Msk             (0x1UL << ADC_CFGR1_WAIT_Pos)           /*!< 0x00004000 */
#define ADC_CFGR1_WAIT                 ADC_CFGR1_WAIT_Msk                      /*!< ADC low power auto wait */
#define ADC_CFGR1_AUTOFF_Pos           (15U)
#define ADC_CFGR1_AUTOFF_Msk           (0x1UL << ADC_CFGR1_AUTOFF_Pos)         /*!< 0x00008000 */
#define ADC_CFGR1_AUTOFF               ADC_CFGR1_AUTOFF_Msk                    /*!< ADC low power auto power off */
#define ADC_CFGR1_DISCEN_Pos           (16U)
#define ADC_CFGR1_DISCEN_Msk           (0x1UL << ADC_CFGR1_DISCEN_Pos)         /*!< 0x00010000 */
#define ADC_CFGR1_DISCEN               ADC_CFGR1_DISCEN_Msk                    /*!< ADC group regular sequencer discontinuous mode */
#define ADC_CFGR1_CHSELRMOD_Pos        (21U)
#define ADC_CFGR1_CHSELRMOD_Msk        (0x1UL << ADC_CFGR1_CHSELRMOD_Pos)      /*!< 0x00200000 */
#define ADC_CFGR1_CHSELRMOD            ADC_CFGR1_CHSELRMOD_Msk                 /*!< ADC group regular sequencer mode */

#define ADC_CFGR1_AWD1SGL_Pos          (22U)
#define ADC_CFGR1_AWD1SGL_Msk          (0x1UL << ADC_CFGR1_AWD1SGL_Pos)        /*!< 0x00400000 */
#define ADC_CFGR1_AWD1SGL              ADC_CFGR1_AWD1SGL_Msk                   /*!< ADC analog watchdog 1 monitoring a single channel or all channels */
#define ADC_CFGR1_AWD1EN_Pos           (23U)
#define ADC_CFGR1_AWD1EN_Msk           (0x1UL << ADC_CFGR1_AWD1EN_Pos)         /*!< 0x00800000 */
#define ADC_CFGR1_AWD1EN               ADC_CFGR1_AWD1EN_Msk                    /*!< ADC analog watchdog 1 enable on scope ADC group regular */

#define ADC_CFGR1_AWD1CH_Pos           (26U)
#define ADC_CFGR1_AWD1CH_Msk           (0x1FUL << ADC_CFGR1_AWD1CH_Pos)        /*!< 0x7C000000 */
#define ADC_CFGR1_AWD1CH               ADC_CFGR1_AWD1CH_Msk                    /*!< ADC analog watchdog 1 monitored channel selection */
#define ADC_CFGR1_AWD1CH_0             (0x01UL << ADC_CFGR1_AWD1CH_Pos)        /*!< 0x04000000 */
#define ADC_CFGR1_AWD1CH_1             (0x02UL << ADC_CFGR1_AWD1CH_Pos)        /*!< 0x08000000 */
#define ADC_CFGR1_AWD1CH_2             (0x04UL << ADC_CFGR1_AWD1CH_Pos)        /*!< 0x10000000 */
#define ADC_CFGR1_AWD1CH_3             (0x08UL << ADC_CFGR1_AWD1CH_Pos)        /*!< 0x20000000 */
#define ADC_CFGR1_AWD1CH_4             (0x10UL << ADC_CFGR1_AWD1CH_Pos)        /*!< 0x40000000 */

/* Definitions for cohabitation of ADC peripherals 2.5Ms/sec and 5Ms/sec accross STM32WB serie */
#define ADC_CFGR_DMAEN_Pos             ADC_CFGR1_DMAEN_Pos
#define ADC_CFGR_DMAEN_Msk             ADC_CFGR1_DMAEN_Msk
#define ADC_CFGR_DMAEN                 ADC_CFGR1_DMAEN
#define ADC_CFGR_DMACFG_Pos            ADC_CFGR1_DMACFG_Pos
#define ADC_CFGR_DMACFG_Msk            ADC_CFGR1_DMACFG_Msk
#define ADC_CFGR_DMACFG                ADC_CFGR1_DMACFG

#define ADC_CFGR_SCANDIR_Pos           ADC_CFGR1_SCANDIR_Pos
#define ADC_CFGR_SCANDIR_Msk           ADC_CFGR1_SCANDIR_Msk
#define ADC_CFGR_SCANDIR               ADC_CFGR1_SCANDIR

#define ADC_CFGR_RES_Pos               ADC_CFGR1_RES_Pos
#define ADC_CFGR_RES_Msk               ADC_CFGR1_RES_Msk
#define ADC_CFGR_RES                   ADC_CFGR1_RES
#define ADC_CFGR_RES_0                 ADC_CFGR1_RES_0
#define ADC_CFGR_RES_1                 ADC_CFGR1_RES_1

#define ADC_CFGR_ALIGN_Pos             ADC_CFGR1_ALIGN_Pos
#define ADC_CFGR_ALIGN_Msk             ADC_CFGR1_ALIGN_Msk
#define ADC_CFGR_ALIGN                 ADC_CFGR1_ALIGN

#define ADC_CFGR_EXTSEL_Pos            ADC_CFGR1_EXTSEL_Pos
#define ADC_CFGR_EXTSEL_Msk            ADC_CFGR1_EXTSEL_Msk
#define ADC_CFGR_EXTSEL                ADC_CFGR1_EXTSEL
#define ADC_CFGR_EXTSEL_0              ADC_CFGR1_EXTSEL_0
#define ADC_CFGR_EXTSEL_1              ADC_CFGR1_EXTSEL_1
#define ADC_CFGR_EXTSEL_2              ADC_CFGR1_EXTSEL_2

#define ADC_CFGR_EXTEN_Pos             ADC_CFGR1_EXTEN_Pos
#define ADC_CFGR_EXTEN_Msk             ADC_CFGR1_EXTEN_Msk
#define ADC_CFGR_EXTEN                 ADC_CFGR1_EXTEN
#define ADC_CFGR_EXTEN_0               ADC_CFGR1_EXTEN_0
#define ADC_CFGR_EXTEN_1               ADC_CFGR1_EXTEN_1

#define ADC_CFGR_OVRMOD_Pos            ADC_CFGR1_OVRMOD_Pos
#define ADC_CFGR_OVRMOD_Msk            ADC_CFGR1_OVRMOD_Msk
#define ADC_CFGR_OVRMOD                ADC_CFGR1_OVRMOD
#define ADC_CFGR_CONT_Pos              ADC_CFGR1_CONT_Pos
#define ADC_CFGR_CONT_Msk              ADC_CFGR1_CONT_Msk
#define ADC_CFGR_CONT                  ADC_CFGR1_CONT
#define ADC_CFGR_AUTDLY_Pos            ADC_CFGR1_WAIT_Pos
#define ADC_CFGR_AUTDLY_Msk            ADC_CFGR1_WAIT_Msk
#define ADC_CFGR_AUTDLY                ADC_CFGR1_WAIT
#define ADC_CFGR_AUTOFF_Pos            ADC_CFGR1_AUTOFF_Pos
#define ADC_CFGR_AUTOFF_Msk            ADC_CFGR1_AUTOFF_Msk
#define ADC_CFGR_AUTOFF                ADC_CFGR1_AUTOFF
#define ADC_CFGR_DISCEN_Pos            ADC_CFGR1_DISCEN_Pos
#define ADC_CFGR_DISCEN_Msk            ADC_CFGR1_DISCEN_Msk
#define ADC_CFGR_DISCEN                ADC_CFGR1_DISCEN
#define ADC_CFGR_CHSELRMOD_Pos         ADC_CFGR1_CHSELRMOD_Pos
#define ADC_CFGR_CHSELRMOD_Msk         ADC_CFGR1_CHSELRMOD_Msk
#define ADC_CFGR_CHSELRMOD             ADC_CFGR1_CHSELRMOD

#define ADC_CFGR_AWD1SGL_Pos           ADC_CFGR1_AWD1SGL_Pos
#define ADC_CFGR_AWD1SGL_Msk           ADC_CFGR1_AWD1SGL_Msk
#define ADC_CFGR_AWD1SGL               ADC_CFGR1_AWD1SGL
#define ADC_CFGR_AWD1EN_Pos            ADC_CFGR1_AWD1EN_Pos
#define ADC_CFGR_AWD1EN_Msk            ADC_CFGR1_AWD1EN_Msk
#define ADC_CFGR_AWD1EN                ADC_CFGR1_AWD1EN

